ecdr/elua/src/platform/lm3s/platform.c
#define PIN_CAN0RX	GPIO_PB4_CAN0RX
#define PIN_CAN0TX	GPIO_PB5_CAN0TX

// Pick one of 3 sets of possible pins for CAN
// BASE			PINS					PIN_CAN0RX			PIN_CAN0TX
// GPIO_PORTB_BASE 	GPIO_PIN_4 | GPIO_PIN_5 	GPIO_PB4_CAN0RX		GPIO_PB5_CAN0TX
// GPIO_PORTE_BASE	GPIO_PIN_4 | GPIO_PIN_5		GPIO_PE4_CAN0RX         GPIO_PE5_CAN0TX         
// GPIO_PORTF_BASE	GPIO_PIN_0 | GPIO_PIN_3		GPIO_PF0_CAN0RX         GPIO_PF3_CAN0TX         

#else

#define CAN_PORT_BASE	GPIO_PORTD_BASE
#define CAN_PORT_PINS	( GPIO_PIN_0 | GPIO_PIN_1 )

// Check this - does it work on 8962?  (Not sure that GPIO_PD0_CAN0RX, TX are defined on that platform)
#define PIN_CAN0RX	GPIO_PD0_CAN0RX
#define PIN_CAN0TX	GPIO_PD1_CAN0TX

// For multiple CANs:
// static const u32 can_gpio_base[] = { GPIO_PORTD_BASE };
// static const u8 can_gpio_pins[] = { GPIO_PIN_0 | GPIO_PIN_1 };
#endif

/* This assumes that RX and TX pins will be on same port.  
Stellarisware defines the following for some CPUs (e.g. 8962)
#define CAN0RX_PERIPH           SYSCTL_PERIPH_GPIOD
#define CAN0RX_PORT             GPIO_PORTD_BASE
#define CAN0RX_PIN              GPIO_PIN_0

#define CAN0TX_PERIPH           SYSCTL_PERIPH_GPIOD
#define CAN0TX_PORT             GPIO_PORTD_BASE
#define CAN0TX_PIN              GPIO_PIN_1
*/


// TODO: generalize to multiple CANs 

// static const u32 can_base[] = { CAN0_BASE };
// static const u32 can_sysctl[] = { SYSCTL_PERIPH_CAN0 };
// static const peripheral cans[] = { {CAN0_BASE, SYSCTL_PERIPH_CAN0} };

// static const u32 can_int[] = { INT_CAN0 };
// Would also need to make can data fields into array
// typedef struct {u32 rx_flag, tx_flag, err_flag; char tx_buf[8]; tCANMsgObject msg_rx;} can_status;
// can_status can_stat[NUM_CAN];


volatile u32 can_rx_flag = 0;
volatile u32 can_tx_flag = 0;
volatile u32 can_err_flag = 0;
char can_tx_buf[8];
tCANMsgObject can_msg_rx;

// LM3S9Bxx and LM4F120 MCU CAN seems to run off of system clock, LM3S8962 has 8 MHz clock

#if defined( FORLM3S8962 )
#define LM3S_CAN_CLOCK  8000000
#else
#define LM3S_CAN_CLOCK  SysCtlClockGet()
#endif


void CANIntHandler(void)
{
  u32 status = CANIntStatus(CAN0_BASE, CAN_INT_STS_CAUSE);

// ToDO: Why not use a switch statement?
  if(status == CAN_INT_INTID_STATUS)
  {
    status = CANStatusGet(CAN0_BASE, CAN_STS_CONTROL);
// Why is the status fetched but not used?
    can_err_flag = 1;
    can_tx_flag = 0;
  }
  else if( status == 1 ) // Message receive
  {
    CANIntClear(CAN0_BASE, 1);
    can_rx_flag = 1;
    can_err_flag = 0;
  }
  else if( status == 2 ) // Message send
  {
    CANIntClear(CAN0_BASE, 2);
    can_tx_flag = 0;
    can_err_flag = 0;
  }
  else
    CANIntClear(CAN0_BASE, status);
}


void cans_init( void )
{
  MAP_SysCtlPeripheralEnable( SYSCTL_PERIPH_CAN0 ); 
  MAP_CANInit( CAN0_BASE );
  CANBitRateSet(CAN0_BASE, LM3S_CAN_CLOCK, 500000);
  MAP_CANIntEnable( CAN0_BASE, CAN_INT_MASTER | CAN_INT_ERROR | CAN_INT_STATUS );
  MAP_IntEnable(INT_CAN0);
  MAP_CANEnable(CAN0_BASE);

  // Configure default catch-all message object
  can_msg_rx.ulMsgID = 0;
  can_msg_rx.ulMsgIDMask = 0;
  can_msg_rx.ulFlags = MSG_OBJ_RX_INT_ENABLE | MSG_OBJ_USE_ID_FILTER;
  can_msg_rx.ulMsgLen = 8;
  MAP_CANMessageSet(CAN0_BASE, 1, &can_msg_rx, MSG_OBJ_TYPE_RX);
}

u32 platform_can_setup( unsigned id, u32 clock )
{  
  GPIOPinConfigure(PIN_CAN0RX);
  GPIOPinConfigure(PIN_CAN0TX);
  MAP_GPIOPinTypeCAN(CAN_PORT_BASE, CAN_PORT_PINS);

  MAP_CANDisable(CAN0_BASE);
  CANBitRateSet(CAN0_BASE, LM3S_CAN_CLOCK, clock );
  MAP_CANEnable(CAN0_BASE);
  return clock;
}

void platform_can_send( unsigned id, u32 canid, u8 idtype, u8 len, const u8 *data )
{
  tCANMsgObject msg_tx;
  const char *s = ( char * )data;
  char *d;

  // Wait for outgoing messages to clear
  while( can_tx_flag == 1 );

  msg_tx.ulFlags = MSG_OBJ_TX_INT_ENABLE;
  
  if( idtype == ELUA_CAN_ID_EXT )
    msg_tx.ulFlags |= MSG_OBJ_EXTENDED_ID;
  
  msg_tx.ulMsgIDMask = 0;
  msg_tx.ulMsgID = canid;
  msg_tx.ulMsgLen = len;
  msg_tx.pucMsgData = ( u8 * )can_tx_buf;

  d = can_tx_buf;
  DUFF_DEVICE_8( len,  *d++ = *s++ );

  can_tx_flag = 1;
  CANMessageSet(CAN0_BASE, 2, &msg_tx, MSG_OBJ_TYPE_TX);
}

int platform_can_recv( unsigned id, u32 *canid, u8 *idtype, u8 *len, u8 *data )
{
  // wait for a message
  if( can_rx_flag != 0 )
  {
    can_msg_rx.pucMsgData = data;
    CANMessageGet(CAN0_BASE, 1, &can_msg_rx, 0);
    can_rx_flag = 0;

    *canid = ( u32 )can_msg_rx.ulMsgID;
    *idtype = ( can_msg_rx.ulFlags & MSG_OBJ_EXTENDED_ID )? ELUA_CAN_ID_EXT : ELUA_CAN_ID_STD;
    *len = can_msg_rx.ulMsgLen;
    return PLATFORM_OK;
  }
  else
    return PLATFORM_UNDERFLOW;
}

#endif


// ****************************************************************************
// SPI

// FORLM4F120 has 4 SPIs - need way to specify how many to use

// Think I fixed the defines, but haven't looked at the code to figure out
// Whether might work on LM4F or if needs more fixing.
// LM4F120 can map SSI 1 to either port D or port F (check code to see implications)
//

#ifdef FORLM4F120
static const u32 spi_base[] = { SSI0_BASE, SSI1_BASE, SSI2_BASE, SSI3_BASE };
static const u32 spi_sysctl[] = { SYSCTL_PERIPH_SSI0, SYSCTL_PERIPH_SSI1, 
                                  SYSCTL_PERIPH_SSI2, SYSCTL_PERIPH_SSI3};

// PIN information from LM4F120H5QR Datasheet
static const u32 spi_gpio_base[] = { GPIO_PORTA_BASE, GPIO_PORTF_BASE, 
                                     GPIO_PORTB_BASE, GPIO_PORTD_BASE };
static const u8 spi_gpio_pins[] = { GPIO_PIN_2 | GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_5,
                                    GPIO_PIN_2 | GPIO_PIN_3 | GPIO_PIN_0 | GPIO_PIN_1,
                                    GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7,
                                    GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3,
 };
//                                  SSIxClk      SSIxFss      SSIxRx       SSIxTx
static const u32 spi_gpio_clk_base[] = { GPIO_PORTA_BASE, GPIO_PORTF_BASE, GPIO_PORTB_BASE, GPIO_PORTD_BASE };
static const u8 spi_gpio_clk_pin[] = { GPIO_PIN_2, GPIO_PIN_2, GPIO_PIN_4, GPIO_PIN_0};

#else

