ecdr/elua/src/platform/lm3s/platform.c
// Same configuration on LM3S8962, LM3S6965, LM3S6918 and LM3S9B92 (2 SPI ports)
// All possible LM3S SPIs defs

// FIXME this anticipates support for a platform with 2 SPI port

//  PIN info extracted from LM3S6950 and 5769 datasheets
static const u32 spi_base[] = { SSI0_BASE, SSI1_BASE };
static const u32 spi_sysctl[] = { SYSCTL_PERIPH_SSI0, SYSCTL_PERIPH_SSI1 };

#if defined( ELUA_BOARD_SOLDERCORE )
static const u32 spi_gpio_base[] = { GPIO_PORTA_BASE, GPIO_PORTF_BASE };
static const u8 spi_gpio_pins[] = {  GPIO_PIN_4 | GPIO_PIN_5,
                                     GPIO_PIN_4 | GPIO_PIN_5 };
//                                   SSIxRx       SSIxTx

static const u32 spi_gpio_clk_base[] = { GPIO_PORTA_BASE, GPIO_PORTH_BASE };
static const u8 spi_gpio_clk_pin[] = { GPIO_PIN_2, GPIO_PIN_4 };
#else
static const u32 spi_gpio_base[] = { GPIO_PORTA_BASE, GPIO_PORTE_BASE };
static const u8 spi_gpio_pins[] = { GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_5,
                                    GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 };
//                                  SSIxClk      SSIxFss      SSIxRx       SSIxTx
static const u32 spi_gpio_clk_base[] = { GPIO_PORTA_BASE, GPIO_PORTE_BASE };
static const u8 spi_gpio_clk_pin[] = { GPIO_PIN_2, GPIO_PIN_0 };
#endif
#endif


#if defined( ELUA_BOARD_SOLDERCORE )

static const u32 ssi_pin_rx[] =  { GPIO_PF4_SSI1RX };
static const u32 ssi_pin_tx[] =  { GPIO_PF5_SSI1TX };
static const u32 ssi_pin_clk[] = { GPIO_PH4_SSI1CLK };
// static const u32 ssi_pin_fss[] = {  };

// ToDo: Need general pin mux handling
#elif defined( FORLM4F120 )

static const u32 ssi_rx_pin[] =  {GPIO_PA4_SSI0RX,  GPIO_PD3_SSI1TX,  GPIO_PB7_SSI2TX,  GPIO_PD3_SSI3TX };
static const u32 ssi_tx_pin[] =  {GPIO_PA5_SSI0TX,  GPIO_PD2_SSI1RX,  GPIO_PB6_SSI2RX,  GPIO_PD2_SSI3RX };
static const u32 ssi_clk_pin[] = {GPIO_PA2_SSI0CLK, GPIO_PD0_SSI1CLK, GPIO_PB4_SSI2CLK, GPIO_PD0_SSI3CLK};
static const u32 ssi_fss_pin[] = {GPIO_PA3_SSI0FSS, GPIO_PD1_SSI1FSS, GPIO_PB5_SSI2FSS, GPIO_PD1_SSI3FSS};

#endif

/*
GPIO_PB4_SSI2CLK  (also CAN0RX)
GPIO_PB5_SSI2FSS  (also CAN0TX)

GPIO_PF0_SSI1RX   (also CAN0RX)
GPIO_PF1_SSI1TX 
GPIO_PF2_SSI1CLK
GPIO_PF3_SSI1FSS  (also CAN0TX)
*/

static void spis_init()
{
  unsigned i;

#if defined( ELUA_BOARD_SOLDERCORE )
  GPIOPinConfigure( GPIO_PH4_SSI1CLK );
  GPIOPinConfigure( GPIO_PF4_SSI1RX );
  GPIOPinConfigure( GPIO_PF5_SSI1TX );
#else
// TODO: fix Pin Mux
#ifdef USE_PIN_MUX

  for( i = 0; i < NUM_SPI; i ++ ){
    GPIOPinConfigure(ssi_rx_pin[i]);
    GPIOPinConfigure(ssi_tx_pin[i]);
    GPIOPinConfigure(ssi_clk_pin[i]);
//    GPIOPinConfigure(ssi_fss_pin[i]);
  };
#endif
#endif

  for( i = 0; i < NUM_SPI; i ++ )
    MAP_SysCtlPeripheralEnable( spi_sysctl[ i ] );
}

u32 platform_spi_setup( unsigned id, int mode, u32 clock, unsigned cpol, unsigned cpha, unsigned databits )
{
  unsigned protocol;

  if( cpol == 0 )
    protocol = cpha ? SSI_FRF_MOTO_MODE_1 : SSI_FRF_MOTO_MODE_0;
  else
    protocol = cpha ? SSI_FRF_MOTO_MODE_3 : SSI_FRF_MOTO_MODE_2;
  mode = mode == PLATFORM_SPI_MASTER ? SSI_MODE_MASTER : SSI_MODE_SLAVE;
  MAP_SSIDisable( spi_base[ id ] );

  MAP_GPIOPinTypeSSI( spi_gpio_base[ id ], spi_gpio_pins[ id ] );
  MAP_GPIOPinTypeSSI( spi_gpio_clk_base[ id ], spi_gpio_clk_pin[ id ] );

  // FIXME: not sure this is always "right"
  GPIOPadConfigSet( spi_gpio_base[ id ], spi_gpio_pins[ id ], GPIO_STRENGTH_4MA, GPIO_PIN_TYPE_STD_WPU );
  GPIOPadConfigSet( spi_gpio_clk_base[ id ], spi_gpio_clk_pin[ id ], GPIO_STRENGTH_4MA, GPIO_PIN_TYPE_STD_WPU );

  MAP_SSIConfigSetExpClk( spi_base[ id ], MAP_SysCtlClockGet(), protocol, mode, clock, databits );
  MAP_SSIEnable( spi_base[ id ] );
  return clock;
}

spi_data_type platform_spi_send_recv( unsigned id, spi_data_type data )
{
  MAP_SSIDataPut( spi_base[ id ], data );
  MAP_SSIDataGet( spi_base[ id ], &data );
  return data;
}

void platform_spi_select( unsigned id, int is_select )
{
  // This platform doesn't have a hardware SS pin, so there's nothing to do here
  id = id;
  is_select = is_select;
}


// ****************************************************************************
// I2C

// Testing - code exists up in elua, there is platform code in AVR32, STR9
// TODO: Code here is incomplete (doesn't handle ACK, doesn't handle burst transfers)

#ifdef BUILD_I2C

#ifdef FORLM4F120
const u32 i2c_base[] = { I2C0_MASTER_BASE, I2C1_MASTER_BASE, I2C2_MASTER_BASE, I2C3_MASTER_BASE };
static const u32 i2c_sysctl[] = { SYSCTL_PERIPH_I2C0, SYSCTL_PERIPH_I2C1, SYSCTL_PERIPH_I2C2, SYSCTL_PERIPH_I2C3 };
static const u32 i2c_gpio_base[] = { GPIO_PORTB_BASE, GPIO_PORTA_BASE, GPIO_PORTE_BASE, GPIO_PORTD_BASE };
static const u8 i2c_gpio_pins[] = { GPIO_PIN_2 | GPIO_PIN_3, GPIO_PIN_6 | GPIO_PIN_7, GPIO_PIN_4 | GPIO_PIN_5, GPIO_PIN_0 | GPIO_PIN_1 };

static const i2c_scl_pin[] = { GPIO_PB2_I2C0SCL, GPIO_PA6_I2C1SCL, GPIO_PE4_I2C2SCL, GPIO_PD0_I2C3SCL };
static const i2c_sda_pin[] = { GPIO_PB3_I2C0SDA, GPIO_PA7_I2C1SDA, GPIO_PE5_I2C2SDA, GPIO_PD1_I2C3SDA };


#elif defined( FORLM6918 ) || defined( FORLM6965 ) || defined( FORLM3S9B92 ) || defined( FORLM3S9D92 )
//FIXME: Fill in base, pins, etc - have 2 I2C (though may not all use same ports)

#elif defined( FORLM8962 )
//FIXME: Fill in base, pins, etc. (1 I2C)


const u32 i2c_base[] = { I2C_MASTER_BASE };
static const u32 i2c_sysctl[] = { SYSCTL_PERIPH_I2C0 };
//FIXME: needs pin mux data (or suppress that behavior)
static const u32 i2c_gpio_base[] = {};
static const u8 i2c_gpio_pins[] = {};

static const i2c_scl_pin[] = {};
static const i2c_sda_pin[] = {};
#endif


// FIXME: just copied from others, need to check documents
static void I2Cs_init()
{
  unsigned i;
  for( i = 0; i < NUM_I2C; i ++ )
    MAP_SysCtlPeripheralEnable(i2c_sysctl[ i ]);
}


// Platform specific
// Not finished - needs to enable I2C, needs to figure out speed, clock should be from cache
u32 platform_i2c_setup( unsigned id, u32 speed )
{
  //FIXME: Pin mux - may not need for all parts

#ifdef USE_PIN_MUX
  GPIOPinConfigure(i2c_scl_pin[ id ]);
  GPIOPinConfigure(i2c_sda_pin[ id ]);
#endif

  MAP_GPIOPinTypeI2C( i2c_gpio_base [ id ], i2c_gpio_pins[ id ] );

  MAP_I2CMasterInitExpClk( i2c_base[id], MAP_SysCtlClockGet(),  
                    speed == PLATFORM_I2C_SPEED_SLOW);
  //FIXME: Needs to return speed actually set
};


// Address is 0..127, direction - from enum, return is boolean
int platform_i2c_send_address( unsigned id, u16 address, int direction )
{
	BOOL bReceive = (direction == PLATFORM_I2C_DIRECTION_RECEIVER);

  MAP_I2CMasterSlaveAddrSet( i2c_base[id], address, receive	);

