ecdr/elua/src/platform/lm3s/platform.c
  if (bReceive) I2CMasterControl(i2c_base[id], I2C_MASTER_CMD_SINGLE_RECEIVE);
  // Dummy receive so don't get junk on first read

  // FIXME: Not finished - needs to return boolean
}; // Returns boolean  - need to figure out semantics for return

// FIXME: Arbitrarily defined - just number of loops, should be based on time
#define I2C_MAX_WAIT	100000

//TODO: Current code waits until done, not sure if that is desired semantics
int platform_i2c_send_byte( unsigned id, u8 data )
{
  u32 i;
  tBoolean busy;

  //FIXME: Timeout should probably be based on time, not just loop cycles
  for(i=0; i<I2C_MAX_WAIT && busy = MAP_I2CMasterBusBusy( i2c_base[id] ); i++) {}; // Wait until bus free
  if(busy)
	  return 0;	// Still busy - return error
  MAP_I2CMasterDataPut( i2c_base[id], data);
  MAP_I2CMasterControl( i2c_base[id], I2C_MASTER_CMD_SINGLE_SEND);

  //FIXME: Timeout should probably be based on time, not just loop cycles
  for(i=0; i<I2C_MAX_WAIT && MAP_I2CMasterBusBusy( i2c_base[id] ); i++) {};		// Wait until sent

  // Return 0 for problem, 1 for success
  return (MAP_I2CMasterError( i2c_base[id] ) == I2C_MASTER_ERR_NONE) ? 1 : 0;
};

//FIXME: what should this do?
void platform_i2c_send_start( unsigned id )
{
};

//FIXME: Just a guess at what this might do
void platform_i2c_send_stop( unsigned id )
{
	MAP_I2CMasterControl( i2c_base[id], I2C_MASTER_CMD_BURST_SEND_FINISH );
};


// return byte read, or -1, ack is true except for last item read
// (ack is acknowledge bit to send 1 to acknowledge, 0 to reject/stop)

int platform_i2c_recv_byte( unsigned id, int ack )
{
    I2CMasterControl( i2c_base[id], I2C_MASTER_CMD_SINGLE_RECEIVE);

	return MAP_I2CMasterDataGet( i2c_base[id] );
	// FIXME: this doesn't check for errors, doesn't use ack
};



/*
From AVR:

int platform_i2c_send_address( unsigned id, u16 address, int direction )
{
  // Convert enum codes to R/w bit value.
  // If TX == 0 and RX == 1, this test will be removed by the compiler
  if ( ! ( PLATFORM_I2C_DIRECTION_TRANSMITTER == 0 &&
           PLATFORM_I2C_DIRECTION_RECEIVER == 1 ) ) {
    direction = ( direction == PLATFORM_I2C_DIRECTION_TRANSMITTER ) ? 0 : 1;
  }

  // Low-level returns nack (0=acked); we return ack (1=acked).
  return ! i2c_write_byte( (address << 1) | direction );
}

*/

#endif	// BUILD_I2C


// ****************************************************************************
// UART
// Different configurations for LM3S8962, LM3S6918 (2 UARTs) and LM3S6965, LM3S9B92 (3 UARTs)

// FIXME FORLM4F120 has 8 UART - need way to specify how many want to use
// If implement USB, then remove UART6 - since it uses PD4,5 (so put UART6 last)

#ifdef FORLM4F120
const u32 uart_base[] = { 	UART0_BASE, UART1_BASE, UART2_BASE, UART3_BASE, 
      				UART4_BASE, UART5_BASE, UART7_BASE, UART6_BASE };
static const u32 uart_sysctl[] = { 
	SYSCTL_PERIPH_UART0, SYSCTL_PERIPH_UART1, SYSCTL_PERIPH_UART2, SYSCTL_PERIPH_UART3, 
	SYSCTL_PERIPH_UART4, SYSCTL_PERIPH_UART5, SYSCTL_PERIPH_UART7, SYSCTL_PERIPH_UART6 };

static const u32 uart_gpio_base[] = { GPIO_PORTA_BASE, GPIO_PORTB_BASE, GPIO_PORTD_BASE, 
      GPIO_PORTC_BASE, GPIO_PORTC_BASE, GPIO_PORTE_BASE, GPIO_PORTE_BASE, GPIO_PORTD_BASE };
static const u8 uart_gpio_pins[] = { GPIO_PIN_0 | GPIO_PIN_1, GPIO_PIN_0 | GPIO_PIN_1, 
	GPIO_PIN_6 | GPIO_PIN_7, GPIO_PIN_6 | GPIO_PIN_7, 
	GPIO_PIN_4 | GPIO_PIN_5, GPIO_PIN_4 | GPIO_PIN_5, 
	GPIO_PIN_0 | GPIO_PIN_1, GPIO_PIN_4 | GPIO_PIN_5 };

// Not really sure what this does, or if filled it in right
// Looks like this is really 2 fields per UUART (should be in a struct) with GPIO_PORTs and PINs
static const u32 uart_gpiofunc[] = {
	GPIO_PA0_U0RX, GPIO_PA1_U0TX, GPIO_PB0_U1RX, GPIO_PB1_U1TX,
	GPIO_PD6_U2RX, GPIO_PD7_U2TX, GPIO_PC6_U3RX, GPIO_PC7_U3TX, 
	GPIO_PC4_U4RX, GPIO_PC5_U4TX, GPIO_PE4_U5RX, GPIO_PE5_U5TX,
	GPIO_PE0_U7RX, GPIO_PE1_U7TX, GPIO_PD4_U6RX, GPIO_PD5_U6TX };

#else

// All possible LM3S uart defs
const u32 uart_base[] = { UART0_BASE, UART1_BASE, UART2_BASE };
static const u32 uart_sysctl[] = { SYSCTL_PERIPH_UART0, SYSCTL_PERIPH_UART1, SYSCTL_PERIPH_UART2 };
static const u32 uart_gpio_base[] = { GPIO_PORTA_BASE, GPIO_PORTD_BASE, GPIO_PORTG_BASE };
static const u8 uart_gpio_pins[] = { GPIO_PIN_0 | GPIO_PIN_1, GPIO_PIN_2 | GPIO_PIN_3, GPIO_PIN_0 | GPIO_PIN_1 };
static const u32 uart_gpiofunc[] = { GPIO_PA0_U0RX, GPIO_PA1_U0TX, GPIO_PD2_U1RX, GPIO_PD3_U1TX, GPIO_PG0_U2RX, GPIO_PG1_U2TX };
#endif

static void uarts_init()
{
  unsigned i;
  for( i = 0; i < NUM_UART; i ++ )
    MAP_SysCtlPeripheralEnable(uart_sysctl[ i ]);
}

u32 platform_uart_setup( unsigned id, u32 baud, int databits, int parity, int stopbits )
{
  u32 config;

  if( id < NUM_UART )
  {
    MAP_GPIOPinConfigure( uart_gpiofunc[ id << 1 ] );
    MAP_GPIOPinConfigure( uart_gpiofunc[ ( id << 1 ) + 1 ] );
    MAP_GPIOPinTypeUART( uart_gpio_base[ id ], uart_gpio_pins[ id ] );

    switch( databits )
    {
      case 5:
        config = UART_CONFIG_WLEN_5;
        break;
      case 6:
        config = UART_CONFIG_WLEN_6;
        break;
      case 7:
        config = UART_CONFIG_WLEN_7;
        break;
      default:
        config = UART_CONFIG_WLEN_8;
        break;
    }
    config |= ( stopbits == PLATFORM_UART_STOPBITS_1 ) ? UART_CONFIG_STOP_ONE : UART_CONFIG_STOP_TWO;
    if( parity == PLATFORM_UART_PARITY_EVEN )
      config |= UART_CONFIG_PAR_EVEN;
    else if( parity == PLATFORM_UART_PARITY_ODD )
      config |= UART_CONFIG_PAR_ODD;
    else
      config |= UART_CONFIG_PAR_NONE;

    MAP_UARTConfigSetExpClk( uart_base[ id ], MAP_SysCtlClockGet(), baud, config );
    MAP_UARTConfigGetExpClk( uart_base[ id ], MAP_SysCtlClockGet(), &baud, &config );

    MAP_UARTEnable( uart_base[ id ] );
  }
  return baud;
}

void platform_s_uart_send( unsigned id, u8 data )
{
  MAP_UARTCharPut( uart_base[ id ], data );
}

int platform_s_uart_recv( unsigned id, timer_data_type timeout )
{
  u32 base = uart_base[ id ];

  if( timeout == 0 )
    return MAP_UARTCharGetNonBlocking( base );

  return MAP_UARTCharGet( base );
}

